astb_relise/src/Documents/СогласиеНаИнформирование/СогласиеНаИнформирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СогласиеНаИнформирование</name>
  <comment>Согласие на информирование</comment>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>InformationRegister.СогласияНаИнформирование</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>SMS</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Email</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/InformationRegisters/СогласияНаИнформирование/СогласияНаИнформирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СогласияНаИнформирование</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>SMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Email</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Documents/СогласиеНаИнформирование/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект,НОВЫЙ Структура("ИмяЭлементаДляРазмещения","ГруппаДополнительныеРеквизиты"));
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "ПЕЧАТЬ"

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
  УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
  
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "СВОЙСТВА"

// СтандартныеПодсистемы.Свойства
 &НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ...

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ЗаполнитьНаСервере(ПоСуществующимДанным)
	
	Документы.СогласиеНаИнформирование.ЗаполнитьТаблицуДокумента(Объект,ПоСуществующимДанным);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСуществующимДанным(Команда)
	
	ЗаполнитьНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.Работники.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОтсутствующимДанным(Команда)
	
	ЗаполнитьНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиSMS(Команда)
	
	ИзменитьФлажкиSMS(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиEmail(Команда)
	
	ИзменитьФлажкиEmail(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиSMS(Команда)
	
	ИзменитьФлажкиSMS(Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиEmail(Команда)
	
	ИзменитьФлажкиEmail(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьФлажкиSMS(ЗначениеФлажка)
	
	ТаблицаДокумента = Объект.Работники.Выгрузить();
	ТаблицаДокумента.ЗаполнитьЗначения(ЗначениеФлажка,"SMS");
	Объект.Работники.Загрузить(ТаблицаДокумента);
	
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаСервере
Процедура ИзменитьФлажкиEmail(ЗначениеФлажка)
	
	ТаблицаДокумента = Объект.Работники.Выгрузить();
	ТаблицаДокумента.ЗаполнитьЗначения(ЗначениеФлажка,"Email");
	Объект.Работники.Загрузить(ТаблицаДокумента);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущиеНастройкиСотрудника(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СогласияНаИнформированиеСрезПоследних.SMS КАК SMS,
	|	СогласияНаИнформированиеСрезПоследних.Email КАК Email
	|ИЗ
	|	РегистрСведений.СогласияНаИнформирование.СрезПоследних(
	|			&ДатаАнализа,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК СогласияНаИнформированиеСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаАнализа",ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(Объект.Ссылка));
	Запрос.УстановитьПараметр("Сотрудник",	Сотрудник);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		СтруктураНастроек = Новый Структура("SMS, Email", Ложь, Ложь);
	Иначе
		СтруктураНастроек = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат.Выгрузить()[0]);
	КонецЕсли;
		
	Возврат СтруктураНастроек;		
	
КонецФункции	
	
&НаКлиенте
Процедура РаботникиСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.Элементы.Работники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураНастроек = ПолучитьТекущиеНастройкиСотрудника(ТекущиеДанные.Сотрудник);
	
	ТекущиеДанные.SMS 	= СтруктураНастроек.SMS;
	ТекущиеДанные.Email = СтруктураНастроек.Email;
	
КонецПроцедуры
